In [1]:
import warnings
warnings.filterwarnings(action='ignore') 

import pandas as pd
import numpy as np
import csv
import folium
import matplotlib.pyplot as plt
plt.rc('font',family='D2CodingLigature Nerd Font')

In [2]:
df = pd.DataFrame({'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
                   'test': [45, 30, 40, 37, 48],
                   'assign1': [20, 17, 22, 18, 24],
                   'assign2': [19, 14, 18, 15, 25],
                   'total': [84, 61, 80, 70, 97]})

df

      name  test  assign1  assign2  total
0  Jessica    45       20       19     84
1     Liam    30       17       14     61
2   Sophia    40       22       18     80
3     Ryan    37       18       15     70
4     Alex    48       24       25     97

In [4]:
df.rename(columns={'test':'exam'})   ## 열 이름 변경이 적용되지 않음
df

      name  test  assign1  assign2  total
0  Jessica    45       20       19     84
1     Liam    30       17       14     61
2   Sophia    40       22       18     80
3     Ryan    37       18       15     70
4     Alex    48       24       25     97

In [ ]:
df2 = df.rename(columns={'test':'exam'})    # 원본데이터프레임이 아닌 새로운 데이터프레임 생성
df2

      name  exam  assign1  assign2  total
0  Jessica    45       20       19     84
1     Liam    30       17       14     61
2   Sophia    40       22       18     80
3     Ryan    37       18       15     70
4     Alex    48       24       25     97

In [ ]:
df.rename(columns={'test':'exam'}, inplace=True)    ## 원본의 열 이름 변경 적용됨
df

      name  exam  assign1  assign2  total
0  Jessica    45       20       19     84
1     Liam    30       17       14     61
2   Sophia    40       22       18     80
3     Ryan    37       18       15     70
4     Alex    48       24       25     97

In [ ]:
df['grade'] = np.where(df['total']>=90, 'A', np.where(df['total']>=80, 'B', 'C'))   # numpy의 where 함수
df

      name  exam  assign1  assign2  total grade
0  Jessica    45       20       19     84     B
1     Liam    30       17       14     61     C
2   Sophia    40       22       18     80     B
3     Ryan    37       18       15     70     C
4     Alex    48       24       25     97     A

In [9]:
df['result'] = np.where(df['total']>=80, 'PASS', 'FAIL')
df

      name  exam  assign1  assign2  total grade result
0  Jessica    45       20       19     84     B   PASS
1     Liam    30       17       14     61     C   FAIL
2   Sophia    40       22       18     80     B   PASS
3     Ryan    37       18       15     70     C   FAIL
4     Alex    48       24       25     97     A   PASS

In [ ]:
df['result'].value_counts()     # 요소를 구분하여 count

result
PASS    3
FAIL    2
Name: count, dtype: int64

In [ ]:
df['grade'].value_counts()

grade
B    2
C    2
A    1
Name: count, dtype: int64

In [ ]:
df[['grade', 'result']].value_counts()      # 3X2=6 총 6개의 경우의 수가 있을 수 있다

grade  result
B      PASS      2
C      FAIL      2
A      PASS      1
Name: count, dtype: int64